

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры


&НаКлиенте
Процедура ИспользоватьTLSПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры


&НаКлиенте
Процедура ТестProducer(Команда)
	ТестProducerНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестProducerНаСервере()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПодключитьВнешнююКомпоненту(ИмяФайлаКомпоненты, "MedIgor", ТипВнешнейКомпоненты.Native, 
		ТипПодключенияВнешнейКомпоненты.НеИзолированно) Тогда
		ВызватьИсключение "Не удалось подключить внешнюю компоненту";
	КонецЕсли;
	
	Producer = Новый ("Addin.MedIgor.RabbitMQ.Stream.Producer");
	ЗаполнитьНастройкиСреды(Producer);
	Producer.SetName("producer1");
	
	Попытка
		Producer.Build(Стрим);
	Исключение
		ВызватьИсключение Producer.LastError;
	КонецПопытки;
	
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	КоличествоСообщений = 1;
	Для к = 1 По КоличествоСообщений Цикл
		Producer.SetApplicationProperty("Дата1", ТекущаяУниверсальнаяДата());
		Producer.SetApplicationProperty("Булево1", Истина);
		Producer.SetApplicationProperty("Число1", 123);                      
		
		// Большие числа нельзя так передавать, потому что в компоненту они передаются как double и теряется точность
		Producer.SetApplicationProperty("БольшоеЧисло1", 123456789123456789);
		
		Текст = СтрШаблон("Hello: %1", к);
		Тело = ПолучитьДвоичныеДанныеИзСтроки(Текст);
		Producer.AddMessage(Тело);
	КонецЦикла;
	Producer.BatchSend();
	//Statuses = Producer.Statuses();
	
	Конец = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Сообщить(СтрШаблон("Длительность: %1", Конец - Начало));
	
КонецПроцедуры


&НаКлиенте
Процедура ТестConsumer(Команда)
	ТестConsumerНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестConsumerНаСервере()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПодключитьВнешнююКомпоненту(ИмяФайлаКомпоненты, "MedIgor", ТипВнешнейКомпоненты.Native, 
		ТипПодключенияВнешнейКомпоненты.НеИзолированно) Тогда
		ВызватьИсключение "Не удалось подключить внешнюю компоненту";
	КонецЕсли;
	
	Consumer = Новый ("Addin.MedIgor.RabbitMQ.Stream.Consumer");
	ЗаполнитьНастройкиСреды(Consumer);
	Consumer.SetName("consumer1");
	
	Попытка
		Consumer.Build(Стрим);
	Исключение
		ВызватьИсключение Consumer.LastError;
	КонецПопытки;
	
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	КоличествоСообщений = 0;
	Пока Истина Цикл
		Если Не Consumer.Recv(1000) Тогда
			Прервать;
		КонецЕсли;
		КоличествоСообщений = КоличествоСообщений + 1;
		Тело = ПолучитьСтрокуИзДвоичныхДанных(Consumer.MessageBody());
		Дата = Consumer.ApplicationProperty("Дата1");
		Булево = Consumer.ApplicationProperty("Булево1");
		Число = Consumer.ApplicationProperty("Число1");
		БольшоеЧисло = Consumer.ApplicationProperty("БольшоеЧисло1");
	КонецЦикла;
	
	Если КоличествоСообщений > 0 Тогда
		Offset = Consumer.Offset();
		Consumer.StoreOffset(Offset);
	КонецЕсли;
	
	Конец = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Сообщить(СтрШаблон("Длительность: %1", Конец - Начало));
	
	Сообщить(СтрШаблон("Получено: %1 сообщений", КоличествоСообщений));
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьНастройкиСреды(Клиент)
	
	Если ЗначениеЗаполнено(Сервер) Тогда
		Клиент.SetHost(Сервер);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Порт) Тогда
		Клиент.SetPort(Порт);
	КонецЕсли;
	
	Если ИспользоватьTLS Тогда
		
		Если ЗначениеЗаполнено(СертификатКлиента) И ЗначениеЗаполнено(СекретныйКлючКлиента) Тогда
			Клиент.AddClientCertificatesKeys(СертификатКлиента, СекретныйКлючКлиента);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СертификатСервера) Тогда
			Клиент.AddRootCertificates(СертификатСервера);
		КонецЕсли;
	
	Иначе
		
		Если ЗначениеЗаполнено(Логин) Тогда
			Клиент.SetUsername(Логин);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Пароль) Тогда
			Клиент.SetPassword(Пароль);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.Логин.Видимость = Не ИспользоватьTLS;
	Элементы.Пароль.Видимость = Не ИспользоватьTLS;
	
	Элементы.СертификатКлиента.Видимость = ИспользоватьTLS;
	Элементы.СекретныйКлючКлиента.Видимость = ИспользоватьTLS;
	Элементы.СертификатСервера.Видимость = ИспользоватьTLS;
	
КонецПроцедуры
